In [0]:
import pandas as pd
import numpy as np

In [4]:
midx = pd.MultiIndex.from_product([['A0','A1'], ['B0','B1','B2','B3']])
columns = ['foo', 'bar']
dfmi = pd.DataFrame(np.arange(16).reshape((len(midx), len(columns))),
                        index=midx, columns=columns)
dfmi

       foo  bar
A0 B0    0    1
   B1    2    3
   B2    4    5
   B3    6    7
A1 B0    8    9
   B1   10   11
   B2   12   13
   B3   14   15

In [5]:
idx = pd.IndexSlice
dfmi.loc[idx[:, 'B0':'B1'], :]

       foo  bar
A0 B0    0    1
   B1    2    3
A1 B0    8    9
   B1   10   11

In [7]:
dfmi.loc[idx['A0', :], :]

       foo  bar
A0 B0    0    1
   B1    2    3
   B2    4    5
   B3    6    7

In [32]:
df=pd.read_excel('/content/drive/My Drive/Data/LCMS 422201.xlsx', parse_dates=['Start Date'], usecols=['User Name', 'Start Date', 'Completed Date', 'Job ID'])
df.head()

                  Job ID  ...          Completed Date
0  12-09-19 14-26-01.165  ... 2019-12-09 14:29:13.668
1  12-09-19 13-58-41.686  ... 2019-12-09 14:04:47.193
2  12-02-19 16-31-45.140  ... 2019-12-02 16:38:58.392
3  12-02-19 11-04-49.133  ... 2019-12-02 11:12:55.243
4  12-02-19 10-56-46.217  ... 2019-12-02 11:07:55.843

[5 rows x 4 columns]

In [35]:
df['Start Date'] = df['Start Date'].apply(lambda x: x.strftime('%Y-%m-%d'))

df.head()

                  Job ID User Name  Start Date          Completed Date
0  12-09-19 14-26-01.165   chemist  2019-12-09 2019-12-09 14:29:13.668
1  12-09-19 13-58-41.686   chemist  2019-12-09 2019-12-09 14:04:47.193
2  12-02-19 16-31-45.140   chemist  2019-12-02 2019-12-02 16:38:58.392
3  12-02-19 11-04-49.133   chemist  2019-12-02 2019-12-02 11:12:55.243
4  12-02-19 10-56-46.217   chemist  2019-12-02 2019-12-02 11:07:55.843

In [36]:
df.set_index(['Start Date', 'User Name'], inplace=True)
df.head()

                                     Job ID          Completed Date
Start Date User Name
2019-12-09 chemist    12-09-19 14-26-01.165 2019-12-09 14:29:13.668
           chemist    12-09-19 13-58-41.686 2019-12-09 14:04:47.193
2019-12-02 chemist    12-02-19 16-31-45.140 2019-12-02 16:38:58.392
           chemist    12-02-19 11-04-49.133 2019-12-02 11:12:55.243
           chemist    12-02-19 10-56-46.217 2019-12-02 11:07:55.843

In [45]:
df.sort_index(inplace=True)
df.head()

                                     Job ID          Completed Date
Start Date User Name
2019-11-18 mwall2     11-18-19 17-02-29.537 2019-11-18 17:07:36.341
           mwall2     11-18-19 16-54-47.168 2019-11-18 16:59:49.367
           mwall2     11-18-19 16-40-47.234 2019-11-18 16:48:37.878
2019-11-19 chemist    11-19-19 14-11-16.839 2019-11-19 14:18:20.739
           chemist    11-19-19 14-06-18.612 2019-11-19 14:13:24.909

In [53]:
idx=df.index.get_level_values(0)
idx = sorted(list(set(idx)))[:3]
idx

['2019-11-18', '2019-11-19', '2019-11-20']

In [54]:
df.loc[idx]

                                     Job ID          Completed Date
Start Date User Name
2019-11-18 mwall2     11-18-19 17-02-29.537 2019-11-18 17:07:36.341
           mwall2     11-18-19 16-54-47.168 2019-11-18 16:59:49.367
           mwall2     11-18-19 16-40-47.234 2019-11-18 16:48:37.878
2019-11-19 chemist    11-19-19 14-11-16.839 2019-11-19 14:18:20.739
           chemist    11-19-19 14-06-18.612 2019-11-19 14:13:24.909
2019-11-20 chemist    11-20-19 16-34-56.723 2019-11-20 16:46:04.750
           chemist    11-20-19 16-10-46.263 2019-11-20 16:29:42.666
           chemist    11-20-19 16-05-22.629 2019-11-20 16:18:37.673

In [49]:
df.shape

(37, 2)

In [50]:
df.head()

                                     Job ID          Completed Date
Start Date User Name
2019-11-18 mwall2     11-18-19 17-02-29.537 2019-11-18 17:07:36.341
           mwall2     11-18-19 16-54-47.168 2019-11-18 16:59:49.367
           mwall2     11-18-19 16-40-47.234 2019-11-18 16:48:37.878
2019-11-19 chemist    11-19-19 14-11-16.839 2019-11-19 14:18:20.739
           chemist    11-19-19 14-06-18.612 2019-11-19 14:13:24.909

In [51]:
df.shape[0]

37

In [52]:
df.iloc[:2]

                                     Job ID          Completed Date
Start Date User Name
2019-11-18 mwall2     11-18-19 17-02-29.537 2019-11-18 17:07:36.341
           mwall2     11-18-19 16-54-47.168 2019-11-18 16:59:49.367